база клиента/Reports/ПрайсПлощадка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>ПрайсПлощадка</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиСклад</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияСклад</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиНоменклатура</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияНоменклатура</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияНоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФлажокНастройкиЦеноваяГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦеноваяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСравненияЦеноваяГруппа</Name>
					<Type>
						<v8:Type>ent:ComparisonType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

база клиента/InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЦеныНоменклатуры</Name>
			<Comment>(Упр)</Comment>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцентСкидкиНаценки</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособРасчетаЦены</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыРасчетаЦены</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

база клиента/AccumulationRegisters/ТоварыВРезервеНаСкладах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВРезервеНаСкладах</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументРезерва</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйОрдерНаТовары</v8:Type>
						<v8:Type>cfg:DocumentRef.ВнутреннийЗаказ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СерияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

база клиента/Reports/ПрайсПлощадка/Ext/ObjectModule.bsl
Функция ПустоеЗначениеТипа(ЗаданныйТип)
	
	Если ЗаданныйТип = Тип("Число") Тогда
		Возврат 0;
	ИначеЕсли ЗаданныйТип = Тип("Строка") Тогда
		Возврат "";
	ИначеЕсли ЗаданныйТип = Тип("Дата") Тогда
		Возврат '00010101000000';
	ИначеЕсли ЗаданныйТип = Тип("Булево") Тогда
		Возврат Ложь;
	Иначе
		Возврат Новый (ЗаданныйТип);
	КонецЕсли;
	
КонецФункции // ПустоеЗначениеТипа();

Функция ВидСравненияСтр(ТипВидСравнения)
//	
Если ТипВидСравнения =  ВидСравнения.Равно Тогда
			ВидСравненияСтрокой  =  " = " 
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеРавно Тогда
			ВидСравненияСтрокой  =  "<>"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСписке Тогда
			ВидСравненияСтрокой  =  "В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСписке Тогда
			ВидСравненияСтрокой  =  "НЕ В"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.ВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.ВИерархии Тогда
			ВидСравненияСтрокой  =  "В ИЕРАРХИИ"
ИначеЕсли ТипВидСравнения  =  ВидСравнения.НеВСпискеПоИерархии ИЛИ 
			ТипВидСравнения   =  ВидСравнения.НеВИерархии Тогда
			ВидСравненияСтрокой  =  "НЕ В ИЕРАРХИИ"
КонецЕсли; 
//
Возврат ВидСравненияСтрокой;
//
КонецФункции	

Процедура СформироватьОтчет(тб) Экспорт
	
Макет = ПолучитьМакет("Макет");
обл = макет.ПолучитьОбласть("шапка");

зп = новый запрос;
зп.УстановитьПараметр("ДатаКон", КонецДня(ДатаКон));

Условие1 = ""; 
Условие2 = ""; 
ПечОтбор = "";

Если ФлажокНастройкиНоменклатура тогда
  зп.УстановитьПараметр("Номенклатура", Номенклатура);
  СтрокаСравнения = ВидСравненияСтр(ВидСравненияНоменклатура);
  Условие1 = Условие1+" И СпрНоменклатура.Ссылка "+СтрокаСравнения+" (&Номенклатура) "; 
  Условие2 = Условие2+" И Номенклатура "+СтрокаСравнения+" (&Номенклатура) "; 
  ПечОтбор = ПечОтбор + "Номенклатура: " + ВидСравненияНоменклатура + " " + сокрлп(Номенклатура) + "; "
КонецЕсли;	
Если ФлажокНастройкиНоменклатурнаяГруппа тогда
  зп.УстановитьПараметр("НоменклатурнаяГруппа", НоменклатурнаяГруппа);
  СтрокаСравнения = ВидСравненияСтр(ВидСравненияНоменклатурнаяГруппа);
  Условие1 = Условие1+" И СпрНоменклатура.НоменклатурнаяГруппа "+СтрокаСравнения+" (&НоменклатурнаяГруппа) "; 
  Условие2 = Условие2+" И Номенклатура.НоменклатурнаяГруппа "+СтрокаСравнения+" (&НоменклатурнаяГруппа) "; 
  ПечОтбор = ПечОтбор + "НоменклатурнаяГруппа: " + ВидСравненияНоменклатурнаяГруппа + " " + сокрлп(НоменклатурнаяГруппа) + "; "
КонецЕсли;	
Если ФлажокНастройкиЦеноваяГруппа тогда
  зп.УстановитьПараметр("ЦеноваяГруппа", ЦеноваяГруппа);
  СтрокаСравнения = ВидСравненияСтр(ВидСравненияЦеноваяГруппа);
  Условие1 = Условие1+" И СпрНоменклатура.ЦеноваяГруппа "+СтрокаСравнения+" (&ЦеноваяГруппа) "; 
  Условие2 = Условие2+" И Номенклатура.ЦеноваяГруппа "+СтрокаСравнения+" (&ЦеноваяГруппа) "; 
  ПечОтбор = ПечОтбор + "ЦеноваяГруппа: " + ВидСравненияЦеноваяГруппа + " " + сокрлп(ЦеноваяГруппа) + "; "
КонецЕсли;	


обл.Параметры.ДатаКон = Формат(ДатаКон, "ДФ=dd.MM.yy"); 
обл.Параметры.Организация = Организация;
//обл.Параметры.ПечОтбор = ПечОтбор;  

тб.Вывести(обл);

зп.УстановитьПараметр("ТипЦен", ТипЦен);

// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
//"+Условие1+" 
//"+Условие2+" 
зп.Текст = "ВЫБРАТЬ
           |	СпрНоменклатура.Ссылка КАК Номенклатура,
           |	МАКСИМУМ(Цены.Цена) КАК Цена,
           |	СУММА(Остатки.Остаток) КАК Остаток,
           |	СпрНоменклатура.АртикулКод КАК АртикулКод,
           |	СпрНоменклатура.Бренд
           |ИЗ
           |	Справочник.Номенклатура КАК СпрНоменклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |			ЦеныНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
           |			МАКСИМУМ(ЦеныНоменклатурыСрезПоследних.Цена) КАК Цена
           |		ИЗ
           |			РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ДатаКон, ТипЦен = &ТипЦен "+Условие2+") КАК ЦеныНоменклатурыСрезПоследних
           |		
           |		СГРУППИРОВАТЬ ПО
           |			ЦеныНоменклатурыСрезПоследних.Номенклатура) КАК Цены
           |		ПО СпрНоменклатура.Ссылка = Цены.Номенклатура
           |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |			ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
           |			СУММА(ТоварыНаСкладахОстатки.КоличествоОстаток - ЕСТЬNULL(Резервы.Резерв, 0)) КАК Остаток
           |		ИЗ
           |			РегистрНакопления.ТоварыНаСкладах.Остатки(&ДатаКон, Номенклатура.ЭтоГруппа = ЛОЖЬ "+Условие2+") КАК ТоварыНаСкладахОстатки
           |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
           |					ТоварыВРезервеНаСкладахОстатки.Номенклатура КАК Номенклатура,
           |					СУММА(ТоварыВРезервеНаСкладахОстатки.КоличествоОстаток) КАК Резерв
           |				ИЗ
           |					РегистрНакопления.ТоварыВРезервеНаСкладах.Остатки(&ДатаКон, Номенклатура.ЭтоГруппа = ЛОЖЬ "+Условие2+") КАК ТоварыВРезервеНаСкладахОстатки
           |				
           |				СГРУППИРОВАТЬ ПО
           |					ТоварыВРезервеНаСкладахОстатки.Номенклатура) КАК Резервы
           |				ПО ТоварыНаСкладахОстатки.Номенклатура = Резервы.Номенклатура
           |		
           |		СГРУППИРОВАТЬ ПО
           |			ТоварыНаСкладахОстатки.Номенклатура) КАК Остатки
           |		ПО СпрНоменклатура.Ссылка = Остатки.Номенклатура
           |ГДЕ
           |	СпрНоменклатура.ЭтоГруппа = ЛОЖЬ "+Условие1+"
           |
           |СГРУППИРОВАТЬ ПО
           |	СпрНоменклатура.Ссылка,
           |	СпрНоменклатура.АртикулКод,
           |	СпрНоменклатура.Бренд
           |
           |ИМЕЮЩИЕ
           |	СУММА(Остатки.Остаток) > 0
           |
           |УПОРЯДОЧИТЬ ПО
           |	Номенклатура,
           |	АртикулКод
           |АВТОУПОРЯДОЧИВАНИЕ";

рез = зп.Выполнить();

Выборка = рез.Выбрать();
Пока Выборка.Следующий() цикл

обл = макет.ПолучитьОбласть("строка");

обл.Параметры.Заполнить(Выборка);
обл.Параметры.ПечНоменклатура = СокрЛП(Выборка.Номенклатура.НаименованиеПолное);

тб.Вывести(обл);
	
КонецЦикла;	
	
// =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  =  = 
тб.ОтображатьСетку = Ложь;
тб.ТолькоПросмотр = Истина;
//тб.ОтображатьГруппировки = Истина;
тб.ОтображатьЗаголовки = Ложь;
//тб.ФиксацияСлева = 1;
тб.ФиксацияСверху = 4;
	
КонецПроцедуры //СформироватьОтчет(тб)
